phpMyAdmin SQL Dump
-- version 5.0.2
-- https://www.phpmyadmin.net/
--
-- Hôte : 127.0.0.1:3306
-- Généré le : lun. 09 août 2021 à 09:57
-- Version du serveur :  10.4.13-MariaDB
-- Version de PHP : 7.3.21

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Base de données : `visite`
--

-- --------------------------------------------------------

--
-- Structure de la table `communes`
--

DROP TABLE IF EXISTS `communes`;
CREATE TABLE IF NOT EXISTS `communes` (
  `ID_commune` int(11) NOT NULL AUTO_INCREMENT,
  `pays` varchar(50) COLLATE utf8_unicode_ci DEFAULT NULL,
  `province` varchar(50) COLLATE utf8_unicode_ci DEFAULT NULL,
  `commune` varchar(50) COLLATE utf8_unicode_ci NOT NULL,
  `caidat` varchar(50) COLLATE utf8_unicode_ci DEFAULT NULL,
  `cercle` varchar(50) COLLATE utf8_unicode_ci DEFAULT NULL,
  `domaine` varchar(50) COLLATE utf8_unicode_ci DEFAULT NULL,
  PRIMARY KEY (`ID_commune`)
) ENGINE=MyISAM AUTO_INCREMENT=196 DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- Déchargement des données de la table `communes`
--

INSERT INTO `communes` (`ID_commune`, `pays`, `province`, `commune`, `caidat`, `cercle`, `domaine`) VALUES
(1, 'المغرب', 'ورزازات', 'إدلسان', 'سكورة', 'ورزازات', 'جماعة'),
(2, 'المغرب', 'ورزازات', 'إزناكن', 'وسلسات', 'أمرزكان', 'جماعة'),
(3, '', '', 'إغرم نوكدال', 'إغرم نوكدال', 'أمرزكان', 'جماعة'),
(4, '', '', 'أمرزكان', 'امرزكان', 'أمرزكان', 'جماعة'),
(5, '', '', 'إمي نولاون', 'إمغران', 'ورزازات', 'جماعة'),
(6, '', '', 'أيت زينب', 'امرزكان', 'أمرزكان', 'جماعة'),
(7, '', '', 'بولمان دادس', 'بولمان دادس', 'بولمان دادس', 'جماعة'),
(8, '', '', 'تازناخت', 'باشوية تازناخت', 'باشوية تازناخت', 'بلدية'),
(9, '', '', 'ترميكت', 'أهل ورزازات', 'ورزازات', 'جماعة'),
(10, '', '', 'تلوات', 'تلوات', 'أمرزكان', 'جماعة'),
(11, '', '', 'توندوت', 'إمغران', 'ورزازات', 'جماعة'),
(12, '', '', 'تيديلي', 'إغرم نوكدال', 'أمرزكان', 'جماعة'),
(13, '', '', 'خزامة', 'وسلسات', 'أمرزكان', 'جماعة'),
(14, '', '', 'سكورة أهل الوسط', 'سكورة', 'ورزازات', 'جماعة'),
(15, '', '', 'سيروا', 'وسلسات', 'أمرزكان', 'جماعة'),
(16, '', '', 'غســات', 'إمغران', 'ورزازات', 'جماعة'),
(17, '', '', 'ورزازات', 'باشوية ورزازات', 'باشوية ورزازات', 'بلدية'),
(18, '', '', 'وسلسات', 'وسلسات', 'أمرزكان', 'جماعة'),
(19, 'فرنسا', 'فرنسا', 'فرنسا', 'فرنسا', 'فرنسا', NULL),
(20, 'إسبانيا', 'إسبانيا', 'إسبانيا', NULL, 'إسبانيا', NULL),
(21, 'المغرب', 'تنغير', 'قلعة مكونة', NULL, NULL, NULL),
(22, 'المغرب', 'انكان', 'انزكان', NULL, NULL, NULL),
(23, 'اطاليا', 'اطاليا', 'اطاليا', NULL, NULL, NULL),
(24, 'المغرب', 'تنغير', 'اكنيون', NULL, NULL, NULL),
(25, 'المغرب', 'الرباط', 'الرباط', NULL, NULL, NULL),
(26, 'المغرب', 'اقليم زاكورة', 'تنزولين', NULL, NULL, NULL),
(27, 'المغرب', 'سطات', 'سطات', NULL, NULL, NULL),
(28, 'المغرب', 'اقليم تنغير', 'واكليم', NULL, NULL, NULL),
(29, 'المغرب', 'اكادير', 'اكادير', NULL, NULL, NULL),
(30, 'المغرب', 'تارودانت', 'تارودانت', NULL, NULL, NULL),
(31, 'المغرب', 'تالوين', 'تالوين', NULL, NULL, NULL),
(32, 'المغرب', 'القنيطرة', 'القنيطرة', NULL, NULL, NULL),
(33, 'المغرب', 'فاس', 'فاس', NULL, NULL, NULL),
(34, 'المغرب', 'مكناس', 'مكناس', NULL, NULL, NULL),
(35, 'المغرب', 'طاطا', 'طاطا', NULL, NULL, NULL),
(36, 'المغرب', 'البيضاء', 'البيضاء', NULL, NULL, NULL),
(37, 'المغرب', 'مراكش', 'مراكش', NULL, NULL, NULL),
(38, 'المغرب', 'السمارة', 'السمارة', NULL, NULL, NULL),
(39, 'المغرب', 'العيون', 'العيون', NULL, NULL, NULL),
(40, 'المغرب', 'الداخلة', 'الداخلة', NULL, NULL, NULL),
(41, 'المغرب', 'الرشدية', 'الرشدية', NULL, NULL, NULL),
(42, 'المغرب', 'صفرو', 'صفرو', NULL, NULL, NULL),
(43, 'المغرب', 'تنغير', 'تنغير', NULL, NULL, NULL),
(44, 'المغرب', 'الرشيدية', 'الريصاني', NULL, NULL, NULL),
(45, 'المغرب', 'اسا', 'اسا', NULL, NULL, NULL),
(46, 'المغرب', 'اكدز', 'اكدز', NULL, NULL, NULL),
(47, 'المغرب', 'كلميمة', 'كلميمة', NULL, NULL, NULL),
(48, 'المغرب', 'ارفود', 'ارفود', NULL, NULL, NULL),
(49, 'المغرب', 'طنجة', 'طنجة', NULL, NULL, NULL),
(50, 'المغرب', 'تطوان', 'تطوان', NULL, NULL, NULL),
(51, 'المغرب', 'الناظور', 'الناظور', NULL, NULL, NULL),
(52, 'المغرب', 'الحسيمة', 'الحسيمة', NULL, NULL, NULL),
(53, 'المغرب', 'وجدة', 'وجدة', NULL, NULL, NULL),
(54, 'المغرب', 'الرشيدية', 'تنجداد', NULL, NULL, NULL),
(55, 'المغرب', 'احفير', 'احفير', NULL, NULL, NULL),
(56, 'المغرب', 'بركان', 'بركان', NULL, NULL, NULL),
(57, 'المغرب', 'سيدي سلمان', 'سيدي سلمان', NULL, NULL, NULL),
(58, 'المغرب', 'خنيفرة', 'خنيفرة', NULL, NULL, NULL),
(59, 'المغرب', 'خريبكة', 'خريبكة', NULL, NULL, NULL),
(60, 'المغرب', 'سيدي قاسم', 'سيدي قاسم', NULL, NULL, NULL),
(61, 'المغرب', 'بني ملال', 'بني ملال', NULL, NULL, NULL),
(62, 'المغرب', 'بوجدور', 'بوجدور', NULL, NULL, NULL),
(63, 'المغرب', 'سيد ي ايفني', 'سيدي ايفني', NULL, NULL, NULL),
(64, 'المغرب', 'طنطان', 'طنطان', NULL, NULL, NULL),
(65, 'المغرب', 'الصويرة', 'الصويرة', NULL, NULL, NULL),
(66, 'المغرب', 'افران', 'افرن', NULL, NULL, NULL),
(67, 'المغرب', 'زاكورة', 'زاكورة', NULL, NULL, NULL),
(68, 'المغرب', 'طرفاية', 'طرفاية', NULL, NULL, NULL),
(69, 'المغرب', 'ازيلال', 'ازيلال', NULL, NULL, NULL),
(70, 'المغرب', 'امسمرير', 'امسمرير', NULL, NULL, NULL),
(71, 'المغرب', 'اشتوكة ايت باها', 'اشتوكة ايت بها', NULL, NULL, NULL),
(72, 'المغرب', 'آسفي', 'آسفي', NULL, NULL, NULL),
(73, 'المغرب', 'قلعة السراغنة', 'قلعة السراغنة', NULL, NULL, NULL),
(74, 'المغرب', 'تزارين', 'تزارين', NULL, NULL, NULL),
(75, 'المغرب', 'تمكروت', 'تمكروت', NULL, NULL, NULL),
(76, 'المغرب', 'المحمدية', 'المحمدية', NULL, NULL, NULL),
(77, 'المغرب', 'شيشاوة', 'شيشاوة', NULL, NULL, NULL),
(78, 'بلجيكا', 'بلجيكا', 'بلجيكا', NULL, NULL, NULL),
(79, 'المغرب', 'العرائش', 'العرائش', NULL, NULL, NULL),
(80, 'المغرب', 'تمارة', 'تمارة', NULL, NULL, NULL),
(81, 'الامارات العربية المتحدة', 'الامارات العربية المتحدة', 'الامارات العربية المتحدة', NULL, NULL, NULL),
(82, 'المغرب', 'ازمور', 'ازمور', NULL, NULL, NULL),
(83, 'المانيا', 'المانيا', 'المانيا', NULL, NULL, NULL),
(84, 'المغرب', 'سلا', 'سلا', NULL, NULL, NULL),
(85, 'المغرب', 'كلميم', 'كلميم', NULL, NULL, NULL),
(86, 'المغرب', 'الجديدة', 'الجديدة', NULL, NULL, NULL),
(87, 'ايت اورير', 'ايت اورير', 'ايت اورير', 'ايت اورير', 'ايت اورير', NULL),
(88, 'ابن احمد', 'ابن احمد', 'ابن احمد', 'ابن احمد', 'ابن احمد', NULL),
(89, 'المغرب', 'وزان', 'وزان', NULL, NULL, NULL),
(90, 'المملكة المتحدة بريطانيا', 'انجلترا', 'انجلترا', NULL, NULL, NULL),
(91, 'اسبانيا', 'اسبانيا', 'اسبانيا', NULL, NULL, NULL),
(92, 'المغرب', 'سيدي بنور', 'سيدي بنور', NULL, NULL, NULL),
(93, 'هولندا', 'هولندا', 'هولندا', NULL, NULL, NULL),
(94, 'امغران', 'امغران', 'امغران', 'امغران', 'ورزازات', NULL),
(95, 'المغرب', 'الزاك', 'الزاك', NULL, NULL, NULL),
(96, 'جمهورية مصر العربية', 'القاهرة', 'القاهرة', NULL, NULL, NULL),
(97, 'بريطانيا', 'بريطانيا', 'بريطانيا', 'بريطانيا', 'بريطانيا', NULL),
(98, 'المغرب', 'ايت ملول', 'ايت ملول', NULL, NULL, NULL),
(99, 'المغرب', 'اولاد تايمة', 'اولاد تايمة', NULL, NULL, NULL),
(100, 'المغرب', 'تيزنيت', 'تيزنيت', NULL, NULL, NULL),
(101, 'المغرب', 'ميدلت', 'ميدلت', NULL, NULL, NULL),
(102, 'اليابان', 'اليابان', 'اليابان', NULL, NULL, NULL),
(103, 'المغرب', 'ابن جرير', 'ابن جرير', NULL, NULL, NULL),
(104, 'المغرب', 'الصخيرات', 'الصخيرات', NULL, NULL, NULL),
(105, 'المغرب', 'برشيد', 'برشيد', NULL, NULL, NULL),
(106, 'المغرب', 'شتوكة ايت بها', 'شتوكة ايت بها', NULL, NULL, NULL),
(107, 'اوسرد', 'المغرب', 'اوسرد', 'اوسرد', 'اوسرد', NULL),
(108, 'المغرب', 'الخميسات', 'الخميسات', NULL, NULL, NULL),
(109, 'المغرب', 'أزرو', 'أزرو', NULL, NULL, NULL),
(110, 'امريكا', 'امريكا', 'امريكا', NULL, NULL, NULL),
(111, 'المغرب', 'دمنات', 'دمنات', NULL, NULL, NULL),
(112, 'المغرب', 'زاكورة', 'النقوب', NULL, NULL, NULL),
(113, 'المغرب', 'زاكورة', 'تغبالت', NULL, NULL, NULL),
(114, 'سويسرا', 'سويسرا', 'سويسرا', NULL, NULL, NULL),
(115, 'المغرب', 'تنغير', 'املشيل', NULL, NULL, NULL),
(116, 'تونس', 'تونس', 'تونس', NULL, NULL, NULL),
(117, 'السعودية', 'السعودية', 'السعودية', NULL, NULL, NULL),
(118, 'المغرب', 'أسا', 'أسا', NULL, NULL, NULL),
(119, 'المغرب', 'زاكورة', 'تمزموط', NULL, NULL, NULL),
(120, 'المغرب', 'زاكورة', 'بني زولي', NULL, NULL, NULL),
(121, 'المغرب', 'ابي الجعد', 'ابي الجعد', NULL, NULL, NULL),
(122, 'المغرب', 'أصيلة', 'أصيلة', NULL, NULL, NULL),
(123, 'المغرب', 'تاوريرت', 'تاوريرت', NULL, NULL, NULL),
(124, 'المغرب', 'تنغير', 'تغزوت نيت عطا', NULL, NULL, NULL),
(125, 'المغرب', 'الحوز', 'مسفيوة', NULL, NULL, NULL),
(126, 'المغرب', 'اولــــــــوز', 'اولــــــــوز', NULL, NULL, NULL),
(127, 'المغرب', 'تنغير', 'تلمي', NULL, NULL, NULL),
(128, 'المغرب', 'تنغير', 'النيف', NULL, NULL, NULL),
(129, 'المغرب', 'الحاجب', 'الحاجب', NULL, NULL, NULL),
(130, 'سوريا', 'سوريا', 'سوريا', NULL, NULL, NULL),
(131, 'السنغال', 'السنغال', 'السنغال', NULL, NULL, NULL),
(132, 'المغرب', 'سوق الخميس', 'سوق الخميس', NULL, NULL, NULL),
(133, 'موريطانيا', 'موريطانيا', 'موريطانيا', NULL, NULL, NULL),
(134, 'الشيلي', 'الشيلي', 'الشيلي', NULL, NULL, NULL),
(135, 'النمسا', 'النمسا', 'النمسا', NULL, NULL, NULL),
(136, 'المغرب', 'فكيك', 'فكيك', NULL, NULL, NULL),
(137, 'المغرب', 'بوعرفة', 'بوعرفة', NULL, NULL, NULL),
(138, 'المغرب', 'تازة', 'تازة', NULL, NULL, NULL),
(139, 'ليبيا', 'ليبيا', 'ليبيا', NULL, NULL, NULL),
(140, 'كندا', 'كندا', 'كندا', NULL, NULL, NULL),
(141, 'المغرب', 'تاكونيت', 'تاكونيت', NULL, NULL, NULL),
(142, 'الريش', 'الريش', 'الريش', NULL, NULL, NULL),
(143, 'الجزائر', 'الجزائر', 'الجزائر', NULL, NULL, NULL),
(144, 'كرسيف', 'كرسيف', 'كرسيف', NULL, NULL, NULL),
(145, 'المغرب', 'القصر الكبير', 'القصر الكبير', NULL, NULL, NULL),
(146, 'تاونات', 'تاونات', 'تاونات', NULL, NULL, NULL),
(147, 'البرتغال', 'البرتغال', 'البرتغال', NULL, NULL, NULL),
(148, 'اليونان', 'اليونان', 'اليونان', NULL, NULL, NULL),
(149, 'المغرب', 'تنغير', 'بومالن دادس', NULL, NULL, NULL),
(150, 'بن سليمان', 'بن سليمان', 'بن سليمان', NULL, NULL, NULL),
(151, 'ورزازات', 'إهل ورزازات', 'أهل ورزازات', NULL, NULL, NULL),
(152, 'بلونيا', 'بلونيا', 'بلونيا', NULL, NULL, NULL),
(153, 'الفقيه بن صالح', 'الفقيه بن صالح', 'الفقيه بن صالح', NULL, NULL, NULL),
(154, 'المغرب', 'الحوز', 'الحوز', NULL, NULL, NULL),
(155, 'جمهورية النيجر', 'جمهورية النيجر', 'جمهورية النيجر', NULL, NULL, NULL),
(156, 'الصين', 'الصين', 'الصين', NULL, NULL, NULL),
(157, 'ايرلاندا الشمالية', 'ايرلاندا الشمالية', 'ايرلاندا الشمالية', NULL, NULL, NULL),
(158, 'الخميسات', 'الخميسات', 'تيفلت', NULL, NULL, NULL),
(159, 'ساحل العاج', 'ساحل العاج', 'ساحل العاج', NULL, NULL, NULL),
(160, 'اسرائيل', 'اسرائيل', 'اسرائيل', NULL, NULL, NULL),
(161, 'قطر', 'قطر', 'قطر', NULL, NULL, NULL),
(162, 'بولمان', 'بولمان', 'بولماتن', NULL, NULL, NULL),
(163, 'الغابون', 'الغابون', 'الغابون', NULL, NULL, NULL),
(164, 'النواصر', 'النواصر', 'النواصر', NULL, NULL, NULL),
(165, 'استراليا', 'استراليا', 'استراليا', NULL, NULL, NULL),
(166, 'انجلترا', 'انجلترا', 'انجترا', NULL, NULL, NULL),
(167, 'السويد', 'السويد', 'السويد', NULL, NULL, NULL),
(168, 'فلسطين', 'فلسطين', 'فاسطين', NULL, NULL, NULL),
(169, 'جرادة', 'جرادة', 'جرادة', NULL, NULL, NULL),
(170, 'فلسطين', 'فلسطين', 'فلسطين', NULL, NULL, NULL),
(171, 'بولمان', 'بولمان', 'ميسور', NULL, NULL, NULL),
(172, 'المغرب', 'اسفي', 'اليسوفية', NULL, NULL, NULL),
(173, 'المغرب', 'الفنيدق', 'الفنيدق', NULL, NULL, NULL),
(174, 'المغرب', 'تارودانت', 'اسكاون', NULL, NULL, NULL),
(175, 'ليكسمبورغ', 'ليكسمبورغ', 'ليكسمبورغ', NULL, NULL, NULL),
(176, 'مصر العربية', 'مصر العربية', 'مصر العربية', NULL, NULL, NULL),
(177, 'المغرب', 'تارودانت', 'اولاد النمة', NULL, NULL, NULL),
(178, 'المغرب', 'زاكورة', 'المحاميد', NULL, NULL, NULL),
(179, 'المغرب', 'جرسيف', 'جرسيف', NULL, NULL, NULL),
(180, 'المغرب', 'ميدلت', 'ازرو', NULL, NULL, NULL),
(181, 'رومانيا', 'رومانيا', 'رومانيا', NULL, NULL, NULL),
(182, 'المغرب', 'الخميسات', 'مريرت', NULL, NULL, NULL),
(183, 'المغرب', 'تنغير', 'إميضر', NULL, NULL, NULL),
(184, 'غانا', 'غانا', 'غانا', NULL, NULL, NULL),
(185, 'النيجر', 'النيجر', 'النيجر', NULL, NULL, NULL),
(186, 'مالطا', 'مالطا', 'مالطا', NULL, NULL, NULL),
(187, 'تركيا', 'تركيا', 'تركيا', NULL, NULL, NULL),
(188, 'بلونيا', 'بولونيا', 'بولونيا', NULL, NULL, NULL),
(189, 'الكامرون', 'الكامرون', 'الكامرون', NULL, NULL, NULL),
(190, 'الارجنتين', 'الارجنتين', 'الارجنتين', NULL, NULL, NULL),
(191, 'روسيا', 'روسيا', 'روسيا', NULL, NULL, NULL),
(192, 'المغرب', 'وادي زم', 'وادي زم', NULL, NULL, NULL),
(193, 'المغرب', 'تنغير', 'اغيل نومكون', 'اغيل نومكون', 'بومالن دادس', 'قروي'),
(194, 'المغرب', 'بني ملال', 'الفقيه بن الح', NULL, NULL, NULL);

-- --------------------------------------------------------

--
-- Structure de la table `login`
--

DROP TABLE IF EXISTS `login`;
CREATE TABLE IF NOT EXISTS `login` (
  `login` varchar(50) COLLATE utf8_unicode_ci NOT NULL,
  `password` varchar(50) COLLATE utf8_unicode_ci NOT NULL,
  PRIMARY KEY (`login`)
) ENGINE=MyISAM DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- Déchargement des données de la table `login`
--

INSERT INTO `login` (`login`, `password`) VALUES
('admin', 'admin123');

-- --------------------------------------------------------

--
-- Structure de la table `services`
--

DROP TABLE IF EXISTS `services`;
CREATE TABLE IF NOT EXISTS `services` (
  `ID_service` int(11) NOT NULL AUTO_INCREMENT,
  `Service` varchar(50) COLLATE utf8_unicode_ci NOT NULL,
  `Division` varchar(50) COLLATE utf8_unicode_ci NOT NULL,
  PRIMARY KEY (`ID_service`)
) ENGINE=MyISAM AUTO_INCREMENT=57 DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- Déchargement des données de la table `services`
--

INSERT INTO `services` (`ID_service`, `Service`, `Division`) VALUES
(1, 'الديوان', 'الديوان'),
(2, 'الكتابة الخاصة', 'الكتابة الخاصة للسيد الكاتب العام'),
(3, 'قسم الشؤون الداخلية', 'قسم الشؤون الداخلية'),
(4, 'القسم الاقتصادي والاجتماعي والتنسيق', 'القسم الاقتصادي والاجتماعي والتنسيق'),
(5, 'قسم الموارد البشرية', 'قسم الموارد البشرية'),
(6, 'قسم التجهيز', 'قسم التجهيز'),
(7, 'قسم الشؤون القروية', 'قسم الشؤون القروية'),
(8, 'قسم الجماعات المحلية', 'قسم الجماعات المحلية'),
(9, 'مصلحة الشكايات', 'قسم الشؤون الداخلية'),
(10, 'قسم العمل الاجتماعي', 'قسم العمل الاجتماعي'),
(11, 'قسم التعمير والبيئة', 'قسم التعمير والبيئة'),
(12, 'مصلحة الأنظمة المعلوماتية', 'مصلحة الأنظمة المعلوماتية'),
(13, 'مكتب الضبط', 'الديوان'),
(14, 'مصلحة الشؤون الداخلية', 'قسم الشؤون الداخلية'),
(15, 'المجلس الاقليمي', 'المجلس الاقليمي'),
(16, 'المساعدة الطبية', 'المساعدة الطبية'),
(17, 'الاتصالات', 'الديوان'),
(18, 'مصلحة الجوازات', 'قسم الشؤون الداخلية'),
(19, 'مصلحة حمل السلاح', 'قسم الشؤون الداخلية'),
(20, 'مصلحة الحريات العامة', 'قسم الشؤون الداخلية'),
(21, 'مصلحة الانتخابات', 'قسم الشؤون الداخلية'),
(22, 'مصلحة الحج', 'قسم الشؤون الداخلية'),
(23, 'مصلحة التزود بالكهربة القروية', 'قسم التجهيز'),
(24, 'مصلحة شواهد العوز', 'قسم الشؤون الداخلية'),
(25, 'المنح الجامعية', 'قسم الشؤون الداخلية'),
(26, 'مصلحة التزود بالماء الشروب', 'قسم التجهيز'),
(27, 'مصلحة الصفقات', 'قسم الميزانية والصفقات'),
(28, 'مصلحة الحالة المدنية', 'قسم الجماعات المحلية'),
(29, 'مصلحة النقل وسيارات الاجرة', 'القسم الاقتصادي والاجتماعي والتنسيق'),
(30, 'مصلحة الاراضي الجماعية', 'قسم الشؤون القروية'),
(31, 'المخدع الرئيسي للهاتف بالعمالة', 'الديوان'),
(32, 'مصلحة التعمير والبيئة', 'قسم التعمير والبيئة'),
(33, 'مصلحة الاستثمارات الفلاحية', 'قسم الشؤون القروية'),
(34, 'مصلحة المنازعات', 'قسم الشؤون القروية'),
(35, 'مصلحة المصادقة على الوثائق الادارية والشواهد', 'قسم الجماعات المحلية'),
(36, 'مصلحة شؤون جالية العمال المغاربة بالمهجر', 'القسم الاقتصادي والاجتماعي والتنسيق'),
(37, 'مصلحة مراقبة الاسعار والاثمان', 'القسم الاقتصادي والاجتماعي والتنسيق'),
(38, 'مصلحة تسليم شواهد مزاولة مهنة بيع التبغ', 'القسم الاقتصادي والاجتماعي والتنسيق'),
(39, 'مصلحة المشاريع السياحية', 'القسم الاقتصادي والاجتماعي والتنسيق'),
(40, 'مصلحة تسليم رخص استعمال المتفجرات', 'قسم الشؤون الداخلية'),
(41, 'مصلحة الشكايات الجمعيات', 'قسم الشؤون الداخلية'),
(42, 'قسم الميزانية والصفقات', 'قسم الميزانية والصفقات'),
(43, 'مصلحة الشؤون الدينية', 'قسم الشؤون الداخلية'),
(44, 'مكتب الاجانب', 'قسم الشؤون الداخلية'),
(45, 'مصلحة الصفقات ( الشؤون القروية )', 'الشؤون القروية'),
(46, 'اللاسكي TRANSSE', 'الديوان'),
(47, 'المناطق الخضراء', 'التجهيز'),
(48, 'مصلحة تتبع المشاريع', 'التجهيز'),
(49, 'مصلحة صيانة البنايات والمساكن الادارية ووكيل المدا', 'التجهيز'),
(50, 'مصلحة تتبع مشاريع المبادرة الوطنية للتنمية البشرية', 'التجهيز'),
(51, 'مصلحة الرسم والخرائط', 'التجهيز'),
(52, 'مصلحة العلاقات الادارية', 'التجهيز'),
(53, 'GIZ', 'GIZ'),
(54, 'مصلحة الصفقات ( المجلس الاقليمي )', 'المجلس الاقليمي'),
(55, 'مصلحة البيئة', 'قسم التعمير والبيئة'),
(56, 'مصلحة تصاميم البناء', 'قسم التعمير والبيئة');

-- --------------------------------------------------------

--
-- Structure de la table `visites`
--

DROP TABLE IF EXISTS `visites`;
CREATE TABLE IF NOT EXISTS `visites` (
  `ID_visite` int(11) NOT NULL AUTO_INCREMENT,
  `CIN` varchar(50) COLLATE utf8_unicode_ci NOT NULL,
  `Date` date DEFAULT NULL,
  `Nature` varchar(20) COLLATE utf8_unicode_ci DEFAULT NULL,
  `Sujet` varchar(500) COLLATE utf8_unicode_ci DEFAULT NULL,
  `ID_commune` int(11) DEFAULT NULL,
  `ID_service` int(11) DEFAULT NULL,
  `Observations` varchar(500) COLLATE utf8_unicode_ci DEFAULT NULL,
  PRIMARY KEY (`ID_visite`)
) ENGINE=MyISAM AUTO_INCREMENT=110038 DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- Déchargement des données de la table `visites`
--

INSERT INTO `visites` (`ID_visite`, `CIN`, `Date`, `Nature`, `Sujet`, `ID_commune`, `ID_service`, `Observations`) VALUES
(1, '123456', '2013-02-18', 'جماعية', 'حول الصفقات', 17, 27, NULL),
(2, '456789', '2013-02-19', 'جماعية', 'مقابلة السيد الكاتب العام', 14, 2, '');
-- --------------------------------------------------------

--
-- Structure de la table `visiteurs`
--

DROP TABLE IF EXISTS `visiteurs`;
CREATE TABLE IF NOT EXISTS `visiteurs` (
  `CIN` varchar(100) COLLATE utf8_unicode_ci NOT NULL,
  `ID_visiteur` int(11) NOT NULL AUTO_INCREMENT,
  `NomComplet` varchar(100) COLLATE utf8_unicode_ci DEFAULT NULL,
  `Adresse` varchar(150) COLLATE utf8_unicode_ci DEFAULT NULL,
  `NumTele` varchar(30) COLLATE utf8_unicode_ci DEFAULT NULL,
  PRIMARY KEY (`CIN`),
  UNIQUE KEY `ID_visiteur` (`ID_visiteur`) USING BTREE
) ENGINE=MyISAM AUTO_INCREMENT=30345 DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- Déchargement des données de la table `visiteurs`
--

INSERT INTO `visiteurs` (`CIN`, `ID_visiteur`, `NomComplet`, `Adresse`, `NumTele`) VALUES
('123456', 1, 'visiteur1', 'adresse1', NULL),
('456789', 2, 'visiteur2', 'adresse2', NULL);
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
